aeonSolutions/aeonlabs-ESP32-C-Base-Firmware-Libraries/src/maturity.cpp
#include "maturity.h"
#include "Arduino.h"
#include "interface_class.h"
#include "m_math.h"
#include "onboard_sensors.h"
#include "esp32-hal-psram.h"
#include "FFat.h"
// unique figerprint data ID 
#include "m_atsha204.h"

MATURITY_CLASS::MATURITY_CLASS(){}

void MATURITY_CLASS::init(INTERFACE_CLASS* interface, ONBOARD_SENSORS* onBoardSensors, mSerial* mserial, ONBOARD_LED_CLASS* onboardLED){

    this->mserial= mserial;
    this->mserial->printStr("maturity sensor init...");

    this->interface=interface;
    this->onBoardSensors=onBoardSensors;
    this->onboardLED = onboardLED;

    this->onewire = OneWire(this->EXT_PLUG_DI_IO); 
    this->sensors= DallasTemperature(&onewire);    
    this->sensors.begin();    // initialize the DS18B20 sensor

    this->last_measured_probe_temp=-1;
    this->last_measured_time_delta=-1;     
    this->DATASET_NUM_SAMPLES=0;

    this->interface->config.POWER_PLUG_ALWAYS_ON=false;
    
    this->config.MEASUREMENT_INTERVAL = (1*60*1000); //  mili sec
        
    this->interface->POWER_PLUG_IS_ON=false;

    this->config.custom_maturity_equation_is_summation=true;
    this->hasNewMeasurementValues=false;
    this->currentDatasetPos=-1;

    this->config.custom_maturity_equation="(p-(-10))*dt";
    this->config.custom_strenght_equation="62*log(m)+21";

    this->onewire = OneWire(this->EXT_PLUG_DI_IO); 
    this->sensors= DallasTemperature(&onewire);    
    this->sensors.begin();    // initialize the DS18B20 sensor


    for(int i=0; i<8 ; i++){
        this->measureValues[i]=0.0;
    }

    // {"a","h","pt","dt","p","m","t","u"};
    this->var[0] ="a"; 
    this->var[1] ="h"; 
    this->var[2] ="pt"; 
    this->var[3] ="dt"; 
    this->var[4] ="p"; 
    this->var[5] ="m"; 
    this->var[6] ="t"; 
    this->var[7] ="u";

    // {"*","(", ")","+","=","-","/","%","^"};
    
    this->signs[0] = "*";
    this->signs[1] = "(";
    this->signs[2] = ")";
    this->signs[3] = "+";
    this->signs[4] = "=";
    this->signs[5] = "-";
    this->signs[6] = "/";
    this->signs[7] = "%";
    this->signs[8] = "^";

    this->readSettings();
    this->mserial->printStrln("done.\n");

}


// ********************** for devices with onboard PSRAM *************************************************
int MATURITY_CLASS::get_dataset_memory_availability(){
    int long freeMem= esp_get_free_heap_size();
    this->mserial->printStrln("Free memory: " + String( freeMem ) + " bytes");
    int num_max_elements = ( freeMem / ( sizeof(float)*4 +  sizeof(long int) ) )/5;
    this->mserial->printStrln("The max dataset size can be: " + String( num_max_elements ));

    return num_max_elements;
}


// _______________________________________________________
int MATURITY_CLASS::get_dataset_size(){
    return this->DATASET_NUM_SAMPLES;
}


// ******************* Maturity Models ************************************
 void MATURITY_CLASS::get_dataset_values(int pos ){
    if (this->currentDatasetPos==pos){
        this->mserial->printStrln("data values already in memory");
        return;
    }

    this->mserial->printStrln("opening datset file: " +  this->interface->config.SENSOR_DATA_FILENAME);
    File file = FFat.open("/" + this->interface->config.SENSOR_DATA_FILENAME, "r");
    int counter=0; 
    
    //String var[8]= {"a","h","pt","dt","p","m","t","u"};
    //                 0   1    2    3   4   5   6   7

    String  valStr[8]= {"0.0","0.0","0.0","0.0","0.0","0.0","0.0","0.0"};

    this->mserial->printStrln("get_dataset_values pos:"+ String(pos));
    
    while (file.available()) {
        if (counter == 0 ) {
            // raed the header
            String bin = file.readStringUntil( char(10) );
            Serial.println(bin);

            String bin2 = file.readStringUntil( char(10) ); 
            Serial.println(bin2);
        }
        
        if (counter < pos){
            file.readStringUntil( char(10) );
            counter++;    
        
        }else{

            /*
String dataStr="Local DateTime; Start Time(s); Time delta (s);Probe Temp (*C); Onboard Temp(*C); Onboard Humidity(%); MCU Temp(*C); Onboard Motion X;Onboard Motion Y;Onboard Motion Z;";
dataStr += "Onboard YAW motion X;Onboard YAW motion Y;Onboard YAW motion Z;";
dataStr += "Unique FingerPrint ID (UFPID); Previous UFPID; Internet IP addr; GeoLocation Timestamp; Latitude; Longitude;" + String(char(10));
            */

            this->mserial->printStrln(" reading data:"+ String(counter));

            String bin = file.readStringUntil( ';' ); // RTC Date & Time

            long int timeStart = atol(file.readStringUntil( ';' ).c_str() ); // start time 
            Serial.println(String("Time start:") + String(timeStart) );

            long int timeElapsed = atol(file.readStringUntil( ';' ).c_str() );  // time elapsed sincce previous measurement time
            Serial.println(String("Time elapsed since last measure:") + String(timeElapsed) );
            
            valStr[3] = String( timeElapsed ); // time delta = t since last  measure

            valStr[4] = file.readStringUntil( ';' ); // probe temp = p
            
            Serial.println(String("probe temp:") + String(valStr[4]) );

            valStr[0] = file.readStringUntil( ';' );  // onboard temp = a
            valStr[1] = file.readStringUntil( ';' );  // onboard humidity = h
            valStr[7] = file.readStringUntil( ';' );  // mcu temp = = u

            this->measureValues[0] = (valStr[0].toDouble());    // onboard temp
            this->measureValues[1] = (valStr[1].toDouble());    // onboard humidity
            this->measureValues[2] = 0.0;
            this->measureValues[3] = (valStr[3].toDouble())/3600;    // time delta in hourss
            this->measureValues[4] = (valStr[4].toDouble());    // probe temp
            this->measureValues[5] = 0.0;
            this->measureValues[6] = 0.0;
            this->measureValues[7] = (valStr[7].toDouble());    // mcu temp

            this->mserial->printStrln(" dt >> str:"+ valStr[3] + " double:" + String(this->measureValues[3],3));
            this->mserial->printStrln(" p >> str:"+ valStr[4] + " double:" + String(this->measureValues[4],3));
            break;
        } 
    }
    this->currentDatasetPos=pos;
    file.close();
}

uint8_t  MATURITY_CLASS::get_number_model_vars(String equation){
    uint8_t count =0;

