aeonSolutions/aeonlabs-ESP32-C-Base-Firmware-Libraries/src/maturity.cpp
    //String var[8]= {"a","h","pt","dt","p","m","t","u"};
    //                 0   1    2    3   4   5   6   7

    for(int i=0; i< 8; i++){
        uint8_t idx = equation.indexOf(this->var[i]);
        bool isSignLeft=false;
        bool isSignRight=false;
        
        if (idx>-1 && idx !=255){
            for(int j=0; j< 8; j++){
                
                if(idx>0){
                    if (String(this->signs[j]) == String(equation[idx-1]))
                        isSignLeft=true;
                }else{
                    isSignLeft=true;
                }

                if( (idx + this->signs[j].length()) < (equation.length() - 1 ) ){
                    if (String(this->signs[j]) == String(equation[idx + this->signs[j].length()]))
                        isSignRight=true;
                }else{
                    isSignRight=true;
                }
            }
            
            if (isSignRight && isSignLeft){
                count++;
            }
        }
    } //end for

    return count;
}

// ******************* Maturity Models ************************************
double MATURITY_CLASS::custom_maturity(int pos){
    
    //String var[8]= {"a","h","pt","dt","p","m","t","u"};
    //                 0   1    2    3   4   5   6   7

    te_variable vars[]= { 
                            {.name="a", .address = this->measureValues + 0},  //This assumes that measureValues is double array!!
                            {.name="h", .address = this->measureValues + 1},  
                            {.name="pt", .address = this->measureValues + 2},  
                            {.name="dt", .address = this->measureValues + 3},  
                            {.name="p", .address = this->measureValues + 4},  
                            {.name="m", .address = this->measureValues + 5},  
                            {.name="t", .address = this->measureValues + 6},  
                            {.name="u", .address = this->measureValues + 7}
                        };
    const int numVars = 8; //This refers only to the number of entries in vars!!
 
    int err;
    te_expr *n = te_compile(this->config.custom_maturity_equation.c_str(), vars, numVars, &err);
    if (n) {
        double result=0.0;
        for (int i=0; i<(pos+1); i++){
            get_dataset_values(i);
            result += (double) te_eval(n); 
        }

        te_free(n);
        return result;
    } else {
        this->mserial->printStrln(this->config.custom_maturity_equation + " << error near pos " + String(err-1) , this->mserial->DEBUG_TYPE_ERRORS);
        return (0.0/0.0);
    }
}


// ***************************** Strenght Models ********************************************

double MATURITY_CLASS::custom_strenght(int pos){
    //String var[8]= {"a","h","pt","dt","p","m","t","u"};
    //                 0   1    2    3   4   5   6   7

    te_variable vars[]= { 
                            {.name="a", .address = this->measureValues + 0},  //This assumes that measureValues is double array!!
                            {.name="h", .address = this->measureValues + 1},  
                            {.name="pt", .address = this->measureValues + 2},  
                            {.name="dt", .address = this->measureValues + 3},  
                            {.name="p", .address = this->measureValues + 4},  
                            {.name="m", .address = this->measureValues + 5},  
                            {.name="t", .address = this->measureValues + 6},  
                            {.name="u", .address = this->measureValues + 7}
                        };
    const int numVars = 8; //This refers only to the number of entries in vars!!


    this->mserial->printStrln("m:"+String(  this->measureValues[5]));

    int err;
    te_expr *n = te_compile(this->config.custom_strenght_equation.c_str(), vars, numVars, &err);

    if (n) {
        this->measureValues[5]= custom_maturity(pos);
        const double r = te_eval(n); 
        te_free(n);
        return (double) r;
    } else {
        this->mserial->printStrln(this->config.custom_strenght_equation + " << error near pos " + String(err-1)  , this->mserial->DEBUG_TYPE_ERRORS);
        return (0.0/0.0);
    }
}

 // *************************************************
 String MATURITY_CLASS::validateExpression(String expression){
    //String var[8]= {"a","h","pt","dt","p","m","t","u"};
    //                 0   1    2    3   4   5   6   7

    te_variable vars[]= { 
                            {.name="a", .address = this->measureValues + 0},  //This assumes that measureValues is double array!!
                            {.name="h", .address = this->measureValues + 1},  
                            {.name="pt", .address = this->measureValues + 2},  
                            {.name="dt", .address = this->measureValues + 3},  
                            {.name="p", .address = this->measureValues + 4},  
                            {.name="m", .address = this->measureValues + 5},  
                            {.name="t", .address = this->measureValues + 6},  
                            {.name="u", .address = this->measureValues + 7}
                        };
    const int numVars = 8; //This refers only to the number of entries in vars!!

    /* This will compile the expression and check for errors. */
    int err;
    te_expr *n = te_compile(expression.c_str(), vars, numVars, &err);

    if (n) {
        return "MODEL OK";
    }else{
        /* Show the user where the error is at. */
        this->mserial->printStrln("Error near here" + String(err-1));
        return "Model Error near position num. " + String(err-1);
    }
 }

 // **************************************************************
 // ****************************************************************
 void MATURITY_CLASS::request_measurment_data(){
    time_t timeNow;

