aeonSolutions/aeonlabs-ESP32-C-Base-Firmware-Libraries/src/maturity.cpp
    // GBRL start command not received
    if (this->interface->Measurments_EN==false)
        return;
        
    // GBRL New command received
    if (this->interface->Measurments_NEW){
        this->reinitialize_dataset_file(FFat);
        this->interface->Measurments_NEW=false;
        this->interface->$espunixtimeStartMeasure=millis();
        this->interface->$espunixtimePrev = this->interface->$espunixtimeStartMeasure;
    }

    if ( ( millis() - this->interface->$espunixtimePrev) < this->config.MEASUREMENT_INTERVAL ){ 
        return;
    }

    this->mserial->printStr(" Enable PWR on the ADC Plug..."); 
    if(this->DATASET_NUM_SAMPLES<1){
        this->mserial->printStrln("DONE");
        digitalWrite(this->interface->EXT_PLUG_PWR_EN ,HIGH);
        this->interface->POWER_PLUG_IS_ON=true;
        delay(1000);
    }
            
    // ToDo: time diff error 
    this->last_measured_time_delta = millis() - this->interface->$espunixtimePrev;
    this->interface->$espunixtimePrev = millis();

    this->mserial->printStrln("Time diff (s) = " + String(this->last_measured_time_delta) );

    this->mserial->printStr(" Requesting temperatures..."); 
    sensors.requestTemperatures(); // Send the command to get temperature readings 
    this->mserial->printStrln("DONE"); 

    this->DATASET_NUM_SAMPLES = this->DATASET_NUM_SAMPLES+1;
    
    this->mserial->printStrln("dataset counter:"+String(DATASET_NUM_SAMPLES)); 
    this->mserial->printStr("Temperature("+String(this->DATASET_NUM_SAMPLES)+") is: "); 
    
    last_measured_probe_temp=this->sensors.getTempCByIndex(0);
    this->onBoardSensors->request_onBoard_Sensor_Measurements();
    
    // Save data to the dataset file
    this->save_measurment_record(FFat);

    this->mserial->printStr(String(last_measured_probe_temp));
    this->mserial->printStrln(" ºC");
    
    // __________________________________________________________________________

    //Disable PWR on the PLUG
    if (this->interface->config.POWER_PLUG_ALWAYS_ON==false){
        digitalWrite(this->interface->EXT_PLUG_PWR_EN ,LOW);
        this->interface->POWER_PLUG_IS_ON=false;
    }
    this->hasNewMeasurementValues=true;
}

// -------------------------------------------------------------------------
bool MATURITY_CLASS::reinitialize_dataset_file(fs::FS &fs){
    this->readSettings(FFat);
    if (fs.exists( "/" +  this->interface->config.SENSOR_DATA_FILENAME ) ){
        if( fs.remove( "/" +  this->interface->config.SENSOR_DATA_FILENAME ) !=true ){
            this->mserial->printStrln("Error removing old dataset file" , this->mserial->DEBUG_TYPE_ERRORS);
            return false;
        }  
    }
    auto datasetFile = fs.open("/" +  this->interface->config.SENSOR_DATA_FILENAME , FILE_WRITE); 
    if (datasetFile){
        this->mserial->printStr("Writing sensor data to the dataset file: " + String(this->interface->config.SENSOR_DATA_FILENAME) );
        
        String dataStr="Local DateTime; Start Time(s); Time Delta (s);Probe Temp (*C); Onboard Temp(*C); Onboard Humidity(%); MCU Temp(*C); Onboard Motion X;Onboard Motion Y;Onboard Motion Z;";
        dataStr += "Onboard YAW motion X;Onboard YAW motion Y;Onboard YAW motion Z;";
        dataStr += "Unique FingerPrint ID (UFPID); Previous UFPID; Internet IP addr; GeoLocation Timestamp; Latitude; Longitude;" + String(char(10));
        dataStr+= "Start time(s):;" + String( this->interface->$espunixtimeStartMeasure ) + String(char(10));
        datasetFile.print(dataStr);
        
        datasetFile.close();
        this->mserial->printStrln("DONE.");
        this->DATASET_NUM_SAMPLES =0;
        this->hasNewMeasurementValues=false;
        return true;
    }else{
        this->mserial->printStrln("Error openning  " + this->interface->config.SENSOR_DATA_FILENAME , this->mserial->DEBUG_TYPE_ERRORS);
        this->onboardLED->statusLED( (uint8_t*)(const uint8_t[]){this->onboardLED->LED_RED}, 100,5); 
        return false;
    }
}

// -----------------------------------------------------------------------------------
bool MATURITY_CLASS::save_measurment_record(fs::FS &fs){    
    auto datasetFile = fs.open("/" +  this->interface->config.SENSOR_DATA_FILENAME , FILE_APPEND); 
    if (datasetFile){
        
        this->mserial->printStr("Writing sensor data to the dataset file: " + String(this->interface->config.SENSOR_DATA_FILENAME) );
      
        String dataStr = String( interface->rtc.getDateTime(true) ) + ";" +  String( this->interface->$espunixtimeStartMeasure )  + ";";
        dataStr += String( this->last_measured_time_delta ) + ";" +  String(roundFloat(this->last_measured_probe_temp ,2)) + ";";
        dataStr += String(roundFloat(this->onBoardSensors->aht_temp, 2)) + ";" + String(roundFloat(this->onBoardSensors->aht_humidity,2)) + ";";  
        dataStr += String(roundFloat(this->onBoardSensors->LSM6DS3_TEMP, 2)) + ";";
        dataStr += String(roundFloat(this->onBoardSensors->LSM6DS3_Motion_X, 3)) + ";" + String(roundFloat(this->onBoardSensors->LSM6DS3_Motion_Y, 3)) + ";";
        dataStr += String(roundFloat(this->onBoardSensors->LSM6DS3_Motion_Z, 3)) + ";" + String(roundFloat(this->onBoardSensors->LSM6DS3_GYRO_X, 3)) + ";";
        dataStr += String(roundFloat(this->onBoardSensors->LSM6DS3_GYRO_Y, 3)) + ";" + String(roundFloat(this->onBoardSensors->LSM6DS3_GYRO_Z, 3))  + ";";

        String current_UFPID = macChallengeDataAuthenticity(this->interface, dataStr);
        dataStr+=CryptoICserialNumber(this->interface)+"-"+ current_UFPID;
 
         if(this->DATASET_NUM_SAMPLES==1){
            dataStr+=CryptoICserialNumber(this->interface)+"-"+macChallengeDataAuthenticity(this->interface, "begin of measurements") + ";";
        }else{
            dataStr+=this->previous_UFPID + ";";
        }
        this->previous_UFPID= current_UFPID;
        
        dataStr += this->interface->InternetIPaddress + ";";
        dataStr += this->interface->requestGeoLocationDateTime + ";";
        if ( this->interface->geoLocationInfoJson.isNull() == false ){
            if(this->interface->geoLocationInfoJson.containsKey("lat")){
                dataStr += String(this->interface->geoLocationInfoJson["lat"].as<char*>()) + ";";
                dataStr += String(this->interface->geoLocationInfoJson["lat"].as<char*>()) + ";";
            }
        }
        dataStr += String(char(10));

