aeonSolutions/aeonlabs-ESP32-C-Base-Firmware-Libraries/src/maturity.cpp
        // append data record to the datset file
        datasetFile.print(dataStr);
        datasetFile.close();
        this->mserial->printStrln("DONE.");

        this->mserial->printStrln(dataStr);
        return true;
    }else{
      this->mserial->printStrln("Error openning  " + this->interface->config.SENSOR_DATA_FILENAME , this->mserial->DEBUG_TYPE_ERRORS);
      this->onboardLED->statusLED( (uint8_t*)(const uint8_t[]){this->onboardLED->LED_RED}, 100,5); 
      return false;
    }
}


// --------------------------------------------------------------------------

bool MATURITY_CLASS::saveSettings(fs::FS &fs){
    this->mserial->printStrln("Saving maturity settings...");

    if (fs.exists("/maturity.cfg") )
        fs.remove("/maturity.cfg");

    File settingsFile = fs.open("/maturity.cfg", FILE_WRITE); 
    if ( !settingsFile ){
        this->mserial->printStrln("error creating maturity settings file.");
        return false;
    }
    this->mserial->printStrln( String("Start Position =") + String(settingsFile.position() ) );

    settingsFile.print( String(this->config.custom_maturity_equation_is_summation) + String(';'));
    settingsFile.print( this->config.custom_maturity_equation + String(';'));
    settingsFile.print( this->config.custom_strenght_equation + String(';'));
    settingsFile.print( String(this->config.MEASUREMENT_INTERVAL) + String(';'));

    settingsFile.close();
    return true;
}

bool MATURITY_CLASS::readSettings(fs::FS &fs){    
    File settingsFile = fs.open("/maturity.cfg", FILE_READ);
    if (!settingsFile){
        this->mserial->printStrln("maturity Settings file not found.");
        return false;
    }
    if (settingsFile.size() == 0){
        this->mserial->printStrln("Invalid maturity Settings file found.");
        return false;    
    }

    File settingsFile2 = fs.open("/maturity.cfg", FILE_READ);

    this->mserial->printStrln("File size: " + String( settingsFile.size()) );

    String temp= settingsFile.readStringUntil(';');
    this->config.custom_maturity_equation_is_summation = *(temp.c_str()) != '0';
  
    this->config.custom_maturity_equation = settingsFile.readStringUntil(';');
    this->config.custom_strenght_equation = settingsFile.readStringUntil(';');
    this->config.MEASUREMENT_INTERVAL = atol(settingsFile.readStringUntil( ';' ).c_str() ); 

    settingsFile.close();
    return true;
}

// -------------------------------------------------------------------------------

 bool MATURITY_CLASS::helpCommands(String $BLE_CMD, uint8_t sendTo){
    if($BLE_CMD != "$?" && $BLE_CMD !="$help" )
        return false;

    String dataStr="Concrete Curing GBRL Commands:\n" \
                    "$pt                 - view current probe temperature value\n" \
                    "$st                 - view current strength value\n" \
                    "$ma                 - view current maturity value\n" \
                    "$me new             - initialize a new measurements  dataset\n" \
                    "$me start           - start measurements \n" \
                    "$me end             - end measurements \n" \
                    "$me status          - current measurements status\n" \
                    "$history            - view a list of measurements  history\n" \
                    "$ns                 - view the number of measurements records\n" \
                    "$ma model           - view current maturity model\n" \
                    "$set ma model       - define a new maturity model\n" \
                    "$st model           - view current strength model\n" \
                    "$set st model       - define a new strength model\n" \
                    "$mi                 - view current measurement interval\n" \      
                    "$cfg mi [sec]       - config measurements  interval in seconds\n\n";

    this->interface->sendBLEstring( dataStr, sendTo);  
    return false;
 }

// -------------------------------------------------------------------------------


bool MATURITY_CLASS::gbrl_commands(String $BLE_CMD, uint8_t sendTo){
    long int hourT; 
    long int minT; 
    long int secT; 
    long int daysT;
    String dataStr="";
    long int $timedif;

    if($BLE_CMD=="$st model"){
        dataStr="Current strenght model:\n";
        dataStr +=  this->config.custom_strenght_equation + "\n";
        this->interface->sendBLEstring( dataStr, sendTo);
        return true;
    }
    
    if($BLE_CMD=="$ma model"){
        dataStr="Current maturity model:\n";
        dataStr +=  this->config.custom_maturity_equation + "\n";
        this->interface->sendBLEstring( dataStr, sendTo);
        return true;
    }

    if($BLE_CMD=="$mi"){
        dataStr="Current measurements interval is " + String(roundFloat(this->config.MEASUREMENT_INTERVAL/(60*1000) ,2)) + String(" min") + String(char(10));
        this->interface->sendBLEstring( dataStr, sendTo);
        return true;
    }


    if( $BLE_CMD=="$pt"){
        this->sensors.requestTemperatures(); // Send the command to get temperature readings     
        this->last_measured_probe_temp=this->sensors.getTempCByIndex(0);
        dataStr="Current temperature measured is " + String(roundFloat(this->last_measured_probe_temp ,2))+String(char(176))+String("C") + String(char(10));
        this->interface->sendBLEstring( dataStr, sendTo);
        return true;
    }
    if( $BLE_CMD=="$ma"){
        dataStr="Current maturity value is " + String(roundFloat(this->custom_maturity(this->DATASET_NUM_SAMPLES),2)) + String(char(176)) + String("C.h  ") + String(char(10));     
        this->interface->sendBLEstring( dataStr, sendTo);
        return true;
    }
    if( $BLE_CMD=="$st"){
        dataStr= "Current Strenght value is  "+ String(roundFloat(this->custom_strenght(this->DATASET_NUM_SAMPLES),2))+" Mpa" + String(char(10));    
        this->interface->sendBLEstring( dataStr, sendTo);
        return true;
    }

