aeonSolutions/aeonlabs-ESP32-C-Base-Firmware-Libraries/src/maturity.cpp
    if( $BLE_CMD=="$me status"){
        if( this->interface->Measurments_EN == false){
            dataStr = String("Measurements not started\n\n");
        } else{
            dataStr = String("Measurement started already\n");
            dataStr += "Number of measurements recorded is " + String(this->DATASET_NUM_SAMPLES) + "\n\n";
        }

        this->interface->sendBLEstring( dataStr, sendTo); 
        return true;
    }
    if( $BLE_CMD=="$me new"){
        this->interface->Measurments_NEW=true;
        this->interface->Measurments_EN=false;
        this->DATASET_NUM_SAMPLES=0;
        dataStr=String("New Measurement Dataset started\n\n");
        this->interface->sendBLEstring( dataStr, sendTo); 
        return true;
    }
    if($BLE_CMD=="$me start"){
        if (this->interface->Measurments_EN){
            dataStr = "Measurments already Started on " + this->interface->measurement_Start_Time + "\n\n";
        }else{
            this->DATASET_NUM_SAMPLES=0;
            this->interface->Measurments_NEW=true;
            this->interface->measurement_Start_Time = this->interface->rtc.getDateTime(true);
            this->interface->Measurments_EN=true;
            dataStr = "Measurments Started on " + this->interface->measurement_Start_Time + "\n";
            this->gbrl_summary_measurement_config(sendTo);
        }
        this->interface->sendBLEstring( dataStr, sendTo); 
        return true;

    }
    if( $BLE_CMD=="$me end"){
        if(this->interface->Measurments_EN==false){
            dataStr="Measurments already ended" + String( char(10));
        }else{
            this->interface->Measurments_EN=false;
            dataStr="Measurments Ended on " + String(this->interface->rtc.getDateTime(true)) + String( char(10));
        }
        this->interface->sendBLEstring( dataStr, sendTo); 
        return true;
    }
    if($BLE_CMD=="$ns"){
        dataStr = "Number of data measurements: " + String(this->DATASET_NUM_SAMPLES+1) + String(char(10));
        this->interface->sendBLEstring( dataStr, sendTo);
        return true;
    }
    bool result =false;
    result = this->helpCommands( $BLE_CMD,  sendTo);
    result = this->history($BLE_CMD,  sendTo);
    result = this->cfg_commands($BLE_CMD,  sendTo);
    result = this->measurementInterval($BLE_CMD,  sendTo);    
    
    //this->gbrl_menu_selection();

    result = this->gbrl_menu_custom_model($BLE_CMD,  sendTo);
   
   return result;

}
// ********************************************************
bool MATURITY_CLASS:: gbrl_summary_measurement_config( uint8_t sendTo){
    String dataStr = "Configuration Summary:\n";
    dataStr += "Maturity Model: " + this->config.custom_maturity_equation+ "\n";
    dataStr += "Strenght Model: " + this->config.custom_strenght_equation + "\n";
    dataStr += "Measurment Interval: " + String(this->config.MEASUREMENT_INTERVAL/1000) + " sec.\n";
    this->interface->sendBLEstring( dataStr + String( char(10) ) , sendTo); 
    return true;
}

// ********************************************************
bool MATURITY_CLASS::gbrl_menu_selection(String $BLE_CMD, uint8_t sendTo){
    String dataStr="";
    // SELECT a MENU ******************************************
    if($BLE_CMD.indexOf("$cfg model")>-1){
        if($BLE_CMD=="$cfg model custom"){
            this->selected_menu="$cfg model custom";
            dataStr= "menu selected";
        }else{
            dataStr="option not found";
        }
        this->interface->sendBLEstring( dataStr + String( char(10) ) , sendTo); 
        return true;
    }
    return false;
}

// *******************************************************
bool MATURITY_CLASS::gbrl_model_help(uint8_t sendTo){
    String dataStr="Model variables letters that can be used:" + String( char(10));
    dataStr +="p  - Probe Temperature ( " + String(char(176)) + String("C )") + String( char(10));
    dataStr +="a  - onboard Temperature ( " + String(char(176)) + String("C )") + String( char(10));
    dataStr +="h  - onboard humidity ( % )" + String( char(10));
    dataStr +="t  - current time ( h )" + String( char(10));
    dataStr +="pt - previous time ( h )" + String( char(10));
    dataStr +="dt - delta time = current time - previous time ( h )" + String( char(10));  
    dataStr +="m  - Maturity value ( " + String(char(176)) + String("C.h )") + String( char(10) ); 
    
    this->interface->sendBLEstring( dataStr + String( char(10) ) , sendTo);
    return true; 
}

// *********************************************************
bool MATURITY_CLASS::gbrl_menu_custom_model(String $BLE_CMD, uint8_t sendTo){
    String dataStr="";
    // $set maturity model - define a new custom maturity model
    // $set strength model 

    // select cfg menu
    if($BLE_CMD=="$set ma model"){
        this->selected_menu="$set ma model";
        this->gbrl_model_help(sendTo);
        dataStr="type model formulae:";
        this->interface->sendBLEstring( dataStr + String( char(10) ) , sendTo);
        return true; 
    }else if($BLE_CMD=="$set st model"){
        this->selected_menu=="$set st model";
        this->gbrl_model_help(sendTo);
        dataStr="type model formulae:";
        this->interface->sendBLEstring( dataStr + String( char(10) ) , sendTo); 
        return true;
    }

    // Sub menu selected   *****************************************************
    if (this->selected_menu=="$set ma model"){    
        // validate sring model expression
        String err = validateExpression($BLE_CMD);
        if (err == "MODEL OK"){
            dataStr="model expression validated";
            this->config.custom_maturity_equation=$BLE_CMD;
            this->saveSettings(FFat);
        }else{
            dataStr= "E:" + err;
        }
        this->interface->sendBLEstring( dataStr + String( char(10) ) , sendTo); 
        this->selected_menu = "";
        this->selected_sub_menu="";
        return true;
    } else if (this->selected_menu=="$set st model"){
        // validate sring model expression
        String err = validateExpression($BLE_CMD);
        if (err == "MODEL OK"){
            dataStr="model expression validated";
            this->config.custom_strenght_equation=$BLE_CMD;
            this->saveSettings(FFat);
        }else{
            dataStr= "E:" + err;
        }
        this->interface->sendBLEstring( dataStr + String( char(10) ) , sendTo); 
        this->selected_menu = "";
        this->selected_sub_menu= "";
        return true;
    }

