aeonSolutions/aeonlabs-ESP32-C-Base-Firmware-Libraries/src/maturity.cpp
    return false;
}

// *******************************************************
bool MATURITY_CLASS::cfg_commands(String $BLE_CMD, uint8_t sendTo){
    String dataStr="";
    long int hourT; 
    long int minT; 
    long int secT; 
    long int daysT;
    long int $timedif;

    if($BLE_CMD.indexOf("$cfg mi ")>-1){
        String value= $BLE_CMD.substring(11, $BLE_CMD.length());
        if (isNumeric(value)){
            long int val= (long int) value.toInt();
            if(val>0){
                this->config.MEASUREMENT_INTERVAL=val*1000; // mili seconds 
                this->saveSettings(FFat);

                hourT = (long int) ( this->config.MEASUREMENT_INTERVAL/(3600*1000) );
                minT  = (long int) ( this->config.MEASUREMENT_INTERVAL/(60*1000) - (hourT*60));
                secT  = (long int) ( this->config.MEASUREMENT_INTERVAL/1000 - (hourT*3600) - (minT*60));
                daysT = (long int) (hourT/24);
                hourT = (long int) ( (this->config.MEASUREMENT_INTERVAL/(3600*1000) ) - (daysT*24));
                
                dataStr = "New Measurment ";        
                dataStr += "interval accepted \r\n\n";        
                dataStr += " ["+String(daysT)+"d "+ String(hourT)+"h "+ String(minT)+"m "+ String(secT)+"s "+ String("]\n\n");
                this->interface->sendBLEstring( dataStr, sendTo);
            }else{
                dataStr="Invalid input \r\n";
                this->interface->sendBLEstring( dataStr, sendTo);
            }
            return true;
        }
    }
    return false;
}

// *******************************************************
bool MATURITY_CLASS::measurementInterval(String $BLE_CMD, uint8_t sendTo){
    if($BLE_CMD !="$MEASURE INTERVAL" && $BLE_CMD !="$measure interval")
        return false;

    long int hourT; 
    long int minT; 
    long int secT; 
    long int daysT;
    long int $timedif;
    String dataStr="";

    hourT = (long int) (this->config.MEASUREMENT_INTERVAL/(3600*1000) );
    minT = (long int) (this->config.MEASUREMENT_INTERVAL/(60*1000) - (hourT*60));
    secT =  (long int) (this->config.MEASUREMENT_INTERVAL/1000 - (hourT*3600) - (minT*60));
    daysT = (long int) (hourT/24);
    hourT = (long int) ((this->config.MEASUREMENT_INTERVAL/(3600*1000) ) - (daysT*24));

    dataStr="Measurement Interval" + String(char(10)) + String(daysT)+"d "+ String(hourT)+"h "+ String(minT)+"m "+ String(secT)+"s "+ String(char(10));
    this->interface->sendBLEstring( dataStr, sendTo);
    return true;
}


// ********************************************************
bool MATURITY_CLASS::history(String $BLE_CMD, uint8_t sendTo){
    if($BLE_CMD != "$history"  )
        return false;

  long int hourT; 
  long int minT; 
  long int secT; 
  long int daysT;
  String dataStr="";
  long int $timedif;
  time_t timeNow;
  time(&timeNow);
  
  dataStr = "Data History" +String(char(10));

  File file = FFat.open("/" + this->interface->config.SENSOR_DATA_FILENAME, "r");
  int counter=0; 
  
  Serial.println("History:");
  long int sumTimeDelta=0;

  while (file.available()) {
    if (counter == 0 ) {
        // raed the header
        String bin2 = file.readStringUntil( char(10) );
        bin2 = file.readStringUntil( char(10) );
    }

    String bin = file.readStringUntil( ';' ); // RTC Date & Time

    long int timeStart = atol(file.readStringUntil( (char) ';' ).c_str() ); //start time of measure 

    long int timeDelta = atol(file.readStringUntil( (char) ';' ).c_str() ); // delta time since last measure
    sumTimeDelta+=timeDelta; //elapsed time since start time of measure

    float temp = (file.readStringUntil( (char) ';' ).toFloat()); // probe temp.

    String rest = file.readStringUntil( char(10) ); // remaider of data string line

    $timedif = (timeStart+sumTimeDelta) - timeStart;
    hourT = (long int) ($timedif/3600);
    minT = (long int) ($timedif/60 - (hourT*60));
    secT =  (long int) ($timedif - (hourT*3600) - (minT*60));
    daysT = (long int) (hourT/24);
    hourT = (long int) (($timedif/3600) - (daysT*24));
    
    dataStr +=  ": ["+String(daysT)+"d "+ String(hourT)+"h "+ String(minT)+"m "+ String(secT)+"s "+ String("]  ");    
    dataStr +=  "Temperature: ";
    dataStr += String(roundFloat(temp,2))+String(char(176))+String("C  ");
    dataStr += "Maturity:"+String(roundFloat(this->custom_maturity(counter),2)) + String(char(176)) + String("C.h  ");
    dataStr += "Strenght:"+String(roundFloat(this->custom_strenght(counter),2))+String(" MPa") + String(char(10));

    counter++;     
  }

  file.close();

  dataStr += "--------------- \n";
  this->interface->sendBLEstring( dataStr, sendTo);
  return true;
}

// *********************************************************